<?php

$servername="localhost";
$username="root";
$password="nyshtairyna2004";
$dbname="tax_info";

$conn = new mysqli($servername, $username, $password, $dbname);
if ($conn->connect_error){
    die("Підключення не вдалось". $conn->connect_error);
}
$sql = "INSERT INTO revenue_accounts (settlement, recipient, recipient_code, recipient_bank, account_number, budget_classification_code, tax_name, departmental_sign)
VALUES 
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./14021900', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA458999980333109344000019721', '14021900', 'Пальне', '00 Без деталізації за відомчою ознакою'),
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11010100', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA948999980333129340000019721', '11010100', 'Податок на доходи фізичних осіб, що сплачується податковими агентами, із доходів платника податку у вигляді заробітної плати', '00 Без деталізації за відомчою ознакою'),
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11010400', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA548999980333239382000019721', '11010201', 'Податок на доходи фізичних осіб з грошового забезпечення, грошових винагород та інших виплат, одержаних військовослужбовцями, поліцейськими  та особами рядового і начальницького складу, що сплачується податковими агентами', '00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11010500', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA338999980333169342000019721', '11010400', 'Податок на доходи фізичних осіб, що сплачується податковими агентами, із доходів платника податку інших ніж заробітна плата', '00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11010501', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA278999980333199341000019721', '11010500', 'Податок на доходи фізичних осіб, що сплачується фізичними особами за результатами річного декларування', '00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11011200', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA658999980333199338000019721', '11010501', 'Податок на доходи фізичних осіб, що сплачується фізичними особами, які не підлягають обов’язковому декларуванню', '00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11011300', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA398999980333139343000019721', '11010700', 'Надходження сум реструктурованої заборгованості зі сплати податку на доходи фізичних осіб','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11020200', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA368999980333139356000019721', '11011200', 'Податок на доходи фізичних осіб із доходів спеціалістів резидента Дія Сіті','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11020201', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA448999980333129395000019721', '11011300', 'Податок на доходи фізичних осіб у вигляді мінімального податкового зобов’язання, що підлягає сплаті фізичними особами','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11020202', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA208999980334129860000019721', '11020200', 'Податок на доходи фізичних осіб у вигляді мінімального податкового зобов’язання, що підлягає сплаті фізичними особами','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11020300', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA508999980334199861000019721', '11020201', 'Податок на прибуток підприємств та фінансових установ комунальної власності (району)','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11020500', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA598999980334109806000019721', '11020202', 'Податок на прибуток підприємств та фінансових установ комунальної власності (міської/селищної/сільської територіальної громади)','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11021000', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA718999980333199312000019721', '11020300', 'Податок на прибуток підприємств, створених за участю іноземних інвесторів ','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11021600', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA838999980333139314000019721', '11020500', 'Податок на прибуток іноземних юридичних осіб ','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./12020900', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA348999980333119318000019721', '11021000', 'Податок на прибуток підприємств, який сплачують інші платники','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11010201', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA328999980333159323000019721', '11021600', 'Податок на прибуток фінансових установ, включаючи філіали аналогічних організацій, розташованих на території України, за винятком страхових організацій ','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./13010100', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA898999980334179807000019721', '12020900', 'Податок з власників наземних, водних транспортних засобів та інших самохідних машин і механізмів','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./13010200', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA248999980333199354000019721', '13010100', 'Рентна плата за спеціальне використання лісових ресурсів в частині деревини, заготовленої в порядку рубок головного користування','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./13020100', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA918999980314070502000019721', '13010200', 'Рентна плата за спеціальне використання лісових ресурсів (крім  рентної плати за спеціальне використання лісових ресурсів в частині деревини, заготовленої в порядку рубок головного користування)','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./13020200', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA428999980333109357000019721', '13020100', 'Рентна плата  за спеціальне використання води (крім  рентної плати за спеціальне використання води водних об`єктів місцевого значення)','00 Без деталізації за відомчою ознакою') ,
('Залозецька селищна тг', 'ГУК у Терн.обл./тг смт.Заліз./11010700', '37977599', 'Казначейство України(ел. адм. подат.)', 'UA068999980314010504000019721', '13020200', 'Рентна плата за спеціальне використання води водних об`єктів місцевого значення', '00 Без деталізації за відомчою ознакою');";

// Виконання SQL-запиту
if ($conn->query($sql) === TRUE) {
    echo "Записи успішно вставлено";
} else {
    echo "Помилка: " . $sql . "<br>" . $conn->error;
}

$conn->close();
?>